### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [5]:
# Dependencies and Setup
import pandas as pd
import numpy as np

In [6]:
# File to Load (Remember to Change These)
df_pymoli = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(df_pymoli)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [16]:
num_players = purchase_data["SN"].nunique()
num_players

576

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [8]:
# Number of unique items
number_unique = purchase_data["Item ID"].unique()
unique_items = len(number_unique)
unique_items

183

In [9]:
# Total number of purchases
total_purchases = len(purchase_data)
total_purchases

780

In [10]:
# Total Revenue
total_revenue = sum(purchase_data['Price'])
round(total_revenue,2)

2379.77

In [11]:
# average purchase price
avg_price = round(total_revenue/total_purchases,2)
avg_price

3.05

In [44]:
# Create a summary data frame to hole the results ******* WHY IS NUMBER of UNIQUE ITEMS not listed first in table?
purchasing_analysis = pd.DataFrame([{"Number of Unique Items": unique_items,
                                     'Average Purchase Price': avg_price,
                                    'Total Purchases': total_purchases,
                                    'Total Revenue': total_revenue}])
purchasing_analysis

,Average Purchase Price,Number of Unique Items,Total Purchases,Total Revenue
0,3.05,183,780,2379.77

In [13]:
# Give the data frame cleaner formatting
purchasing_analysis.style.format({'Average Purchase Price': '${:.2f}', 'Total Revenue': '${:,.2f}'})
purchasing_analysis = purchasing_analysis[['Number of Unique Items','Average Purchase Price','Total Purchases','Total Revenue']]
purchasing_analysis

,Number of Unique Items,Average Purchase Price,Total Purchases,Total Revenue
0,183,3.05,780,2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [55]:
#group df by gender
#gender_demographics = purchase_data.groupby('Gender')
gender_count = purchase_data["SN"].nunique()
gender_count

576

In [56]:
#Count of male players
male_count = purchase_data[purchase_data["Gender"] == "Male"]["SN"].nunique()
male_count

484

In [57]:
#Percentage of male players
percent_males = round((male_count/gender_count)*100,0)
percent_males

84.0

In [58]:
#Count of female players
female_count = purchase_data[purchase_data["Gender"] == "Female"]["SN"].nunique()
female_count

81

In [59]:
#Percentage of female players
percent_female = round((female_count/gender_count)*100,0)
percent_female

14.0

In [60]:
#Count of other/non-disclosed players
other_count = purchase_data[purchase_data["Gender"] == "Other / Non-Disclosed"]["SN"].nunique()
other_count

11

In [61]:
#Percentage of other/non=disclosed players
percent_other = round((other_count/gender_count)*100,0)
percent_other

2.0

In [91]:
#Diplay a summary df of these results

gender_demographics = pd.DataFrame({"Gender": ["Male", "Female", "Other/Non-Disclosed"], "Total Count": [male_count, female_count,  other_count], 
                                    "Percentage of Players": [percent_males, percent_female, percent_other]})
gender_demographics

                Gender  Total Count  Percentage of Players
0                 Male          484                   84.0
1               Female           81                   14.0
2  Other/Non-Disclosed           11                    2.0

In [103]:
gender_dem_final = gender_demographics.set_index("Gender") #I had to do this in it's own step - couldn't get it to work otherwise
gender_dem_final

                     Total Count  Percentage of Players
Gender
Male                         484                   84.0
Female                        81                   14.0
Other/Non-Disclosed           11                    2.0

In [104]:
#Clean up formatting:

gender_dem_final.style.format({"Percentage of Players": "{:.0F}%"})


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [141]:
#Run calculations for purchase count by gender
purchase_count_by_gen = pd.DataFrame(purchase_data.groupby("Gender")["Gender"].count())
purchase_count_by_gen

                       Gender
Gender
Female                    113
Male                      652
Other / Non-Disclosed      15

In [112]:
#run calculations for total purchase value by gender
total_purchase_by_gen = pd.DataFrame(purchase_data.groupby('Gender')['Price'].sum())
total_purchase_by_gen

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [122]:
#Run calculations for average purchase price by gender
avg_pur_price_gender = pd.DataFrame(purchase_data.groupby("Gender")["Price"].mean())
avg_pur_price_gender

                          Price
Gender
Female                 3.203009
Male                   3.017853
Other / Non-Disclosed  3.346000

In [135]:
#run calculations for average purchase total per person by gender
 
    #MY HEAD IS SPINNING OVER THIS ONE

In [145]:
#Display sumary of these items in DF -I was trying to merge the DFs but it kept coming up with an error. had to enter manually.

purchasing_analysis_by_gender = pd.DataFrame({"Gender": ["Male", "Female", "Other/Non-Disclosed"], 
                                              "Purchase Count": [652,113,15],
                                              "Total Purchase Value": [1967.64, 361.94, 50.19],
                                             "Average Purchase Price": [3.017853, 3.203009, 3.346000]})

purchasing_analysis_by_gender

,Gender,Purchase Count,Total Purchase Value,Average Purchase Price
0,Male,652,1967.64,3.017853
1,Female,113,361.94,3.203009
2,Other/Non-Disclosed,15,50.19,3.346000

In [149]:
purchasing_analysis_by_gender.style.format({"Purchase Count": "${:.2f}", "Total Purchase Value": "${:.2f}", 
                                            "Average Purchase Price": "${:.2F}"})

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [155]:
#Establish bins for ages
age_bins = [0,10,15,20,25,30,35,40, 45]
age_ranges = ["<10", "10-14","15-19", "20-24", "25-29", "30-34", "35-39", ">=40"]

In [160]:
#Categorize the existing players using the age bins. Hint: use pd.cut()
purchase_data["Age Group"] = pd.cut(purchase_data["Age"],age_bins, labels=age_ranges)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [171]:
# Create new data frame with the added "Age Group" and group it
age_grouped = purchase_data.groupby("Age Group")

In [172]:
# Count total players by age category
total_count_age = age_grouped["SN"].nunique()

In [173]:
# Calculate percentages by age category 
percentage_by_age = (total_count_age/num_players) * 100

In [179]:
age_demographics = pd.DataFrame({"Total Count": total_count_age,"Percentage of Players": percentage_by_age})
age_demographics

           Total Count  Percentage of Players
Age Group
<10                 24               4.166667
10-14               41               7.118056
15-19              150              26.041667
20-24              232              40.277778
25-29               59              10.243056
30-34               37               6.423611
35-39               26               4.513889
>=40                 7               1.215278

In [186]:
#format age_demographics DF
age_demographics.style.format({"Percentage of Players":"{:.0f}%"})

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [201]:
#Bin the purchase_data data frame by age - total purchase count by age group
purchase_count_binned = pd.DataFrame(age_grouped["Price"].count())
purchase_count_binned

           Price
Age Group
<10           32
10-14         54
15-19        200
20-24        325
25-29         77
30-34         52
35-39         33
>=40           7

In [204]:
#Run basic calculations to obtain average purchase price
avg_purchase_price_agegroup = pd.DataFrame(round(age_grouped["Price"].mean(),2))
avg_purchase_price_agegroup

           Price
Age Group
<10         3.40
10-14       2.90
15-19       3.11
20-24       3.02
25-29       2.88
30-34       2.99
35-39       3.40
>=40        3.08

In [205]:
#Run basic calculations to obtain total purchase value
total_purchase_value_agegroup = pd.DataFrame(round(age_grouped["Price"].sum(),2))
total_purchase_value_agegroup

            Price
Age Group
<10        108.96
10-14      156.60
15-19      621.56
20-24      981.64
25-29      221.42
30-34      155.71
35-39      112.35
>=40        21.53

In [ ]:
#Run basic calculations to obtain average purchase total per person by age group
#avg_purchase_total_agegroup =

In [218]:
#Display Summary DF

merged_purchasing_analysis_age = pd.merge(purchase_count_binned,avg_purchase_price_agegroup,on="Age Group")
merged_purchasing_analysis_age = pd.merge(merged_purchasing_analysis_age,total_purchase_value_agegroup,on="Age Group")
merged_purchasing_analysis_age

           Price_x  Price_y   Price
Age Group
<10             32     3.40  108.96
10-14           54     2.90  156.60
15-19          200     3.11  621.56
20-24          325     3.02  981.64
25-29           77     2.88  221.42
30-34           52     2.99  155.71
35-39           33     3.40  112.35
>=40             7     3.08   21.53

In [220]:
merged_purchasing_analysis_age = merged_purchasing_analysis_age.rename(columns={"Price_x": "Purchase Count", 
                                                                                "Price_y": "Average Purchase Price",
                                                                                "Price": "Total Purchase Value"})
merged_purchasing_analysis_age

           Purchase Count  Average Purchase Price  Total Purchase Value
Age Group
<10                    32                    3.40                108.96
10-14                  54                    2.90                156.60
15-19                 200                    3.11                621.56
20-24                 325                    3.02                981.64
25-29                  77                    2.88                221.42
30-34                  52                    2.99                155.71
35-39                  33                    3.40                112.35
>=40                    7                    3.08                 21.53

In [221]:
merged_purchasing_analysis_age.style.format({"Average Purchase Price":"${:.2f}", "Total Purchase Value":"${:.2f}"})

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [223]:
# Group by Screenname 
grouped_by_sn = purchase_data.groupby(["SN"])

In [241]:
#Identify the top 5 spenders in the game by total purchase value, then list in a table 

# Find the sum of the price column per screenname
user_spent = pd.DataFrame(grouped_by_sn["Price"].sum())
user_count = pd.DataFrame(grouped_by_sn["SN"].count())

user_spent.columns = ["Total Spent"]
user_count.columns = ["Total Purchases"]

user_spent.reset_index(inplace=True)
user_count.reset_index(inplace=True)

In [242]:
# Merge the two dfs together
top_five_spenders = pd.merge(user_spent,user_count,on="SN")
# Sort the values by Total Spent
top_five_spenders = top_five.sort_values("Total Purchases",ascending=False)
# Cut the list to the top five
top_five_spenders = top_five.head()
top_five_spenders

             Total Spent  Total Purchases
SN
Lisosia93          18.96                5
Idastidru52        15.45                4
Chamjask73         13.83                3
Iral74             13.62                4
Iskadarya95        13.10                3

In [275]:
# Add a column for Average Purchase Price
top_five_spenders["Average Purchase Price"] = round((top_five_spenders["Total Spent"] / top_five_spenders["Total Purchases"]),2)
top_five_spenders

C:\Users\sarah\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

             Total Spent  Total Purchases  Average Purchase Price
SN
Lisosia93          18.96                5                    3.79
Idastidru52        15.45                4                    3.86
Chamjask73         13.83                3                    4.61
Iral74             13.62                4                    3.40
Iskadarya95        13.10                3                    4.37

In [276]:
top_five_spenders_formatted = top_five_spenders.rename(columns={"Total Purchases": "Purchase Count", 
                                                                                "Total Spent": "Total Purchase Value"})
top_five_spenders_formatted

             Total Purchase Value  Purchase Count  Average Purchase Price
SN
Lisosia93                   18.96               5                    3.79
Idastidru52                 15.45               4                    3.86
Chamjask73                  13.83               3                    4.61
Iral74                      13.62               4                    3.40
Iskadarya95                 13.10               3                    4.37

In [287]:
top_five_spenders_formatted.style.format({"Average Purchase Price":"${:.2f}", "Total Purchase Value":"${:.2f}"})
top_five_spenders_formatted #Why isn't this fomatting?

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                    3.79                 18.96
Idastidru52               4                    3.86                 15.45
Chamjask73                3                    4.61                 13.83
Iral74                    4                    3.40                 13.62
Iskadarya95               3                    4.37                 13.10

In [278]:
top_five_spenders_formatted = top_five_spenders_formatted[["Purchase Count", 
                                                           "Average Purchase Price", 
                                                           "Total Purchase Value"]]
top_five_spenders_formatted

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                    3.79                 18.96
Idastidru52               4                    3.86                 15.45
Chamjask73                3                    4.61                 13.83
Iral74                    4                    3.40                 13.62
Iskadarya95               3                    4.37                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [280]:
#Retrieve column for: Item ID, Item Name, Item Price
column_retrieval = purchase_data[["Item ID", "Item Name", "Price"]]
column_retrieval.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [274]:
#Group by Item ID and Item Name
group_item_name_id = column_retrieval.groupby(["Item ID","Item Name"])

In [ ]:
#Perform Calcuations for
#Purchase Count


#Item Price

#Total Purchase Value

In [ ]:
#Create a Summary DF to hold the results & clean formatting

In [ ]:
#Sort purchase count column in decending order

In [ ]:
#Display preview of summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80




Include a written description of three obesrvable trends based on the data

Two obesrvable trends with this game:
1)There is a larger percentage of males that participate in this game 
2)We see the most purchases between the ages of 25-29 
** Also to consider:  What time frame is this data generated from? Is it per week? Per day?